---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ChangeType Properties
ChangeType Class See Also Send Feedback
---

The ChangeType type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ChangeType Class

Autodesk.Revit.DB Namespace